---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes
source: html/be4b0440-8d50-c403-2125-f26d9a484018.htm
---
# ExternalResourceTypes.BuiltInExternalResourceTypes Members

Provides a container of all Revit built-in ExternalResourceType instances.